<?php

return array(
	'keys' => array(
		'code' => 'code',
		'result' => 'data',
		'message' => 'message',
		'extra' => 'extra',
	),
	'messages' => array(
		100 => '参数错误.',
		101 => '用户名不存在.',
		102 => '用户密码错误.',
		103 => '联系电话格式不正确',
		104 => '未知的生成报表类型',
		105 => '用户名已经存在.',
		106 => '无效的授权信息.',
		107 => '内容过长.',
		108 => '未知的调用方法.',
		109 => '授权信息已经过期',
		110 => '未知的统计信息类型',
	    111 => '请求超时',
	    112 => '非法调用接口',
	    113 => '',
		
		200 => '服务器出小差.',
	    201 => '上传图片信息至云存储服务器错误',
	    202 => '权限不足，请联系系统管理员申请相关权限',
	    203 => '无法删除事件，只有创建者才可删除',
	    204 => '依赖基础方法不存在',
	    205 => '无法更新事件，只有创建者才可更新事件',
	    206 => '无法更新已经删除的事件',
	    207 => '统计任务进行中，无法操作.',
	)
);
